# Создать пустую переменную. Проверить ее на истинность и ложность.
# Объясните полученный результат.

a = 0
b = None

print(bool(a), bool(b))
input("Нажмите Enter, чтобы выйти")

# Есть некоторые значения переменных, которые по определению в Python считаютсяFalse