# глава 1

#print("Моё любимое мороженное называется 20 копеек")

# print("Александр")
# input("Нажмите Enter, чтобы выйти")

# print("Любви достойна только мать")
# print(              "А.Ляпин")

#глава 2


# глава 3

# import random
# a = "Здоровья"
# b = "Счастья"
# c = "Мирного неба"
# d = "Любви"
# e = "Удачи"
# i = " "
# lucky = random.randint(1,5)
# if lucky == 1:
#         print(a)
# elif lucky == 2:
#         print(b)
# elif lucky == 3:
#         print(c)
# elif lucky == 4:
#         print(d)
# elif lucky == 5:
#         print(e)
# input("Нажмите Enter для завершения прогрмаммы")

# Текстовые задачи
# Демонстрирует математические операции

print("Ecли беременная самка бегемота массой 800 кг родит детеныша массой 40 кг,")
print("но затем съест 20 кг корма, то сколько она будет после всего весить?")
input("Чтобы узнать, нажмите Enter." )
print("800 - 40 + 20 =", 800 - 40 + 20)
print("\nЕсли студент, возвращаясь с успешного сданного экзамена, на радостях")
print("купил каждому из 6 друзей по 3 бутылке пива, то сколько всего бутылок пива куплено?")
input("Чтобы узнать, нажмите Enter.")
print("6 * 3 =", 6 * 3)
print("\nЕсли в ресторане вам с приятелями принести счет на 19 долларов (считая чаевые), ")
print("и вы решили скинуться половину на четверых, то сколько придется с каждого?")
input("Чтобы узнать, нажмите Enter.")
print("19 / 4 =", 19 / 4)
print("\nЕсли четверо пиратов найдут ларчик, в котором ровно 107 золотых монет, и")
print("решат разделить добычу поровну, то сколько целых монет достанется каждому?")
print("Чтобы узнать, нажмите Enter.")
print("107 // 4 =", 107 // 4)
print("\nЕсли те же самые четверо пиратов разделят те же 107 монет из ларчика поровну,")
print("то сколько останется ничейных монет?")
input("Чтобы узнать, нажмите Enter.")
print("107 % 4 =", 107 % 4)
input("\n\nНажмите Enter, чтобы выйти.")
