import os
#os.mkdir('folder')    # создает папку

# os.chdir('folder')   # заходит в папку
# print('Текущая директория изменилась на folder: ', os.getcwd())  # вывод текущей папки
#
# os.chdir('..')  # вернуться в предыдуую директорию
#
# os.makedirs('nested1/nested2/nested3') # создоем несколько вложенных папок

################################################################################

# УДАЛЕНИЕ ФАЙЛОВ

#os.remove('folder/renamed-text.txt')

#############################################################################

# удалить папку

#os.rmdir('folder')

############################################################################

# удаление вложенных папок

#os.removedirs('nested1/nested2/nested3')

#########################################################################





